 Program Lab1;
 {В произвольно заданном одномерном массиве определить число отрицательных, нулевых и положительных элементов}
 
 Const
  max = 10 ; //Максимальное количество элементов массива

 Var
  m: array[1..max]of integer;
  i: integer;
  o: integer; //o - число отрицательных элемнетов
  n: integer; //n - число нулевых элемнетов
  p: integer; //p - число положительных элементов
  
   Begin
    p := 0;
    n := 0;
    o := 0; //обнуляем переменные, в которых далее будет суммироваться количество соответствующих элементов
  
     for i := 1 to max do //перебор всех элементов массива
       begin
          m[i] := random(100) - 50;//каждому элементу массива присваиваем случайное число от -50 до 50, полученное с помощью оператора random - генератора случайных чисел
       end; 
       
     for i := 1 to max do //перебор всех элементов массива
       begin
           write(m[i]:5);
       end; //вывод элементов массива и их соответствующих значений
  
     for i := 1 to max do //перебор всех элементов массива
      begin
         if m[i] > 0 //с помощью сравнения узнаем, является ли элемент положительным 
          then p := p + 1 //к количеству положительных элементов прибавляем еще один положительный элемент
          else  
             if m[i] < 0 //узнаем, является ли элемент отрицательным 
             then o := o + 1 //к количеству отрицательных элементов прибавляем еще один отрицательный элемент
             else n := n + 1; //к количеству нулевых элементов прибавляем еще один нулевой элемент
      end;
       
       Writeln; 
       Writeln('Число отрицательных элементов=', o); //вывод ответа
       Writeln('Число нулевых элементов=', n); //вывод ответа
       Writeln('Число положительных элементов=', p); //вывод ответа
             
      
    end.
